import pandas as pd

# Создаем DataFrame с оценками 10 учеников по 5 предметам
data = {
    'Ученик': ['Николай', 'Мария', 'Петр', 'Анна', 'Иван', 'Ольга', 'Алексей', 'Елена', 'Сергей', 'Наталья'],
    'История': [3, 4, 4, 3, 5, 5, 4, 3, 5, 5],
    'Физика': [5, 4, 5, 5, 3, 4, 4, 5, 5, 3],
    'Химия': [4, 5, 3, 5, 3, 3, 2, 5, 5, 4],
    'Математика': [5, 5, 3, 4, 5, 3, 4, 4, 5, 3],
    'Физкультура': [3, 3, 5, 5, 3, 5, 4, 3, 5, 3]
}

df = pd.DataFrame(data)

# Выводим первые несколько строк DataFrame
rows = df.head()
print(rows)

# Вычисляем среднюю оценку по каждому предмету
print(f"Средняя оценка по Истории  - {df['История'].mean()}")
print(f"Средняя оценка по Физике  - {df['Физика'].mean()}")
print(f"Средняя оценка по Химии  - {df['Химия'].mean()}")
print(f"Средняя оценка по Математике  - {df['Математика'].mean()}")
print(f"Средняя оценка по Физкультуре  - {df['Физкультура'].mean()}")

# Вычисляем медианную оценку по каждому предмету
print(f"Медианная оценка по Истории  - {df['История'].median()}")
print(f"Медианная оценка по Физике  - {df['Физика'].median()}")
print(f"Медианная оценка по Химии  - {df['Химия'].median()}")
print(f"Медианная оценка по Математике  - {df['Математика'].median()}")
print(f"Медианная оценка по Физкультуре  - {df['Физкультура'].median()}")

# Вычисляем Q1 и Q3 для оценок по математике

q1_math = df['Математика'].quantile(0.25)
q3_math = df['Математика'].quantile(0.75)
IQR = q3_math - q1_math
print(f"Q1 - {q1_math}")
print(f"Q3 - {q3_math}")
print(f"IQR - {IQR}")

print(f"Стандартное отклонение по Истории  - {df['История'].std()}")
print(f"Стандартное отклонение по Физике  - {df['Физика'].std()}")
print(f"Стандартное отклонение по Химии  - {df['Химия'].std()}")
print(f"Стандартное отклонение по Математике  - {df['Математика'].std()}")
print(f"Стандартное отклонение по Физкультуре  - {df['Физкультура'].std()}")
